src/ex_Tabakon/Enums/ТипыУпаковок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыУпаковок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МаркированныйТовар</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Catalogs/ШтрихкодыУпаковокТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыУпаковокТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗначениеШтрихкода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУпаковки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ex_Tabakon/CommonModules/ШтрихкодированиеМОТП/Ext/Module.bsl
&Вместо("ДанныеНеизвестнойМаркируемойПродукцииБезЗапросаСтатусаМОТП")
Функция ТБКДанныеНеизвестнойМаркируемойПродукцииБезЗапросаСтатусаМОТП(КодыМаркировки, ПараметрыСканирования)
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов(КодыМаркировки, ПараметрыСканирования);
	
	Для Каждого марка Из КодыМаркировки Цикл
		данные = Результат[марка];
		Если данные = неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(данные.Номенклатура) Тогда
			
			мЕАН = новый Массив();
			
			прсингМарки = ШтрихкодированиеИСВызовСервера.РазобратьКодМаркировки(марка, Перечисления.ВидыПродукцииИС.Табачная);
			
			мЕАН.Добавить(прсингМарки.СоставКодаМаркировки.EAN);
			
			ДанныеПоШтрихкодамEAN = ШтрихкодированиеИС.ДанныеПоШтрихкодамEAN(мЕАН);
			Если ДанныеПоШтрихкодамEAN.Количество() > 0 Тогда
				данные.Номенклатура = ДанныеПоШтрихкодамEAN[0].Номенклатура;
			КонецЕсли;
		КонецЕсли;
		
		номенклатура = данные.Номенклатура;
		
		Если номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики Тогда
	
			мрц = данные.МРЦ;
			данные.Характеристика = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьХарактеристику(номенклатура, мрц);
			                                           	
			элКэш = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода",марка);
			Если ЗначениеЗаполнено(элКэш) Тогда
				элКэшОбъект = элКэш.ПолучитьОбъект();
				элКэшОбъект.Номенклатура = данные.Номенклатура;
				элКэшОбъект.Характеристика = данные.Характеристика;
				элКэшОбъект.Записать();
			КонецЕсли;
		иначе	
			данные.Характеристика	=	Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();	
		КонецЕсли;
		
		
		//Вик 2021_05_13
		Если СтрДлина(данные.Штрихкод) = 29 тогда //это qr ввода остатков который прислал честный знак - пробиваем как пачку
			данные.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
			данные.КоличествоБлоков	=	0;
			данные.КоличествоПачек	=	1;
		КонецЕсли;
		//конецвик

		
	КонецЦикла;
	Возврат Результат;
КонецФункции


&Вместо("ПроверитьНаОшибкиПоПравилам")
Процедура ТБКПроверитьНаОшибкиПоПравилам(ДанныеПоШтрихкодам, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ЕстьОшибки)
	// Вставить содержимое метода.
	ПродолжитьВызов(ДанныеПоШтрихкодам, ПравилаПроверкиНаОшибки, ПараметрыСканирования, ЕстьОшибки);
	
	Если ПравилаПроверкиНаОшибки.Свойство("КонтрольВладельца")
		И ПравилаПроверкиНаОшибки.КонтрольВладельца.Количество() > 0 Тогда 
			
		Для Каждого СтрокаДерева Из ПравилаПроверкиНаОшибки.КонтрольВладельца Цикл
			Если ТипЗнч(СтрокаДерева) = Тип("КлючИЗначение") Тогда
				эл = СтрокаДерева.Значение;	
			Иначе
				эл = СтрокаДерева; 
			КонецЕсли;
			Если СтрНачинаетсяС(эл.ТекстОшибки,"ИНН владельца") Тогда
				Сообщить(эл.ТекстОшибки);
				ЗаполнитьЗначенияСвойств(эл, Новый Структура("ТекстОшибки,ЕстьОшибки","",Ложь));
			КонецЕсли;
		КонецЦикла;
			
	КонецЕсли;
	ДанныеПоШтрихкодам.ЕстьОшибкиВДеревеУпаковок=ЛОЖЬ;
	ЕстьОшибки=ЛОЖЬ;
	
	предидущаяХарактеристика=неопределено;
	Для Каждого стр из ДанныеПоШтрихкодам.ДанныеКодовМаркировок Цикл
		
		Если стр.Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики Тогда
			мрц = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМРЦ(стр.КодМаркировки);
			
			Если ЗначениеЗаполнено(мрц) Тогда
				стр.Характеристика = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьХарактеристику(
					стр.Номенклатура,
					мрц
				);
				Если ДанныеПоШтрихкодам.ОбработанныеШтрихкоды[стр.КодМаркировки] <> неопределено Тогда
					ДанныеПоШтрихкодам.ОбработанныеШтрихкоды[стр.КодМаркировки].Характеристика  = стр.Характеристика;
				КонецЕсли;
				
			Иначе
				стр.Характеристика = предидущаяХарактеристика;
			КонецЕсли;
			предидущаяХарактеристика = стр.Характеристика;
			
			//Если НЕ стр.ЭтоУпаковка Тогда
			//	элКэш = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода",стр.КодМаркировки);
			//	Если ЗначениеЗаполнено(элКэш) Тогда					
			//		ДанныеНовойУпаковки = Справочники.ШтрихкодыУпаковокТоваров.СтруктураСозданияШтрихкодаУпаковки();
			//		ЗаполнитьЗначенияСвойств(ДанныеНовойУпаковки, стр);
			//		ДанныеНовойУпаковки.Штрихкод    = стр.КодМаркировки;
			//		ДанныеНовойУпаковки.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
			//		ДанныеНовойУпаковки.Количество  = 1;	
			//		СсылкаНаЭлемент = Справочники.ШтрихкодыУпаковокТоваров.СоздатьШтрихкодУпаковки(ДанныеНовойУпаковки);
			//	КонецЕсли;	
			//КонецЕсли;
		КонецЕсли;			
	КонецЦикла;
	
	Если ДанныеПоШтрихкодам.Свойство("ВложенныеШтрихкоды") Тогда		
		Если ДанныеПоШтрихкодам.ВложенныеШтрихкоды <> неопределено Тогда
			Если ДанныеПоШтрихкодам.ВложенныеШтрихкоды.МаркированныеТовары <> неопределено Тогда
				стр.Характеристика = предидущаяХарактеристика;
			КонецЕсли;
			
			Если ДанныеПоШтрихкодам.ВложенныеШтрихкоды.ДеревоУпаковок <> неопределено Тогда
				Для Каждого стр из ДанныеПоШтрихкодам.ВложенныеШтрихкоды.ДеревоУпаковок.Строки Цикл
					стр.Характеристика = предидущаяХарактеристика;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Для Каждого СтрокаДерева Из ДанныеПоШтрихкодам.ВложенныеШтрихкоды.ДеревоУпаковок Цикл
КонецПроцедуры


&Вместо("ЗаполнитьВложенныеШтрихкодыПолученныеИзСервиса")
Процедура ТБКЗаполнитьВложенныеШтрихкодыПолученныеИзСервиса(ВложенныеШтрихкоды, ТаблицаEAN, ПараметрыСканирования)
	ПродолжитьВызов(ВложенныеШтрихкоды, ТаблицаEAN, ПараметрыСканирования);
КонецПроцедуры


&После("ОбработатьШтрихкодыНеизвестныхУпаковок")
Процедура ТБКОбработатьШтрихкодыНеизвестныхУпаковок(ДанныеПоШтрихкодам, ПараметрыСканирования)
	Попытка
		Если СтрДлина(ДанныеПоШтрихкодам.ДанныеКодовМаркировок[0].КодМаркировки) = 29 тогда	
			Если ДанныеПоШтрихкодам.ТекстОшибки	=	"Запрещено запрашивать данные по неизвестным штрихкодам в МОТП." тогда
				//ДанныеПоШтрихкодам.ЕстьОшибки = ложь;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры


&Вместо("ДанныеНеизвестнойМаркируемойПродукции")
Функция ТБКДанныеНеизвестнойМаркируемойПродукции(Штрихкоды, ПараметрыСканирования, ТекстОшибки)
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов(Штрихкоды, ПараметрыСканирования, ТекстОшибки);
	
	Результат = ДанныеНеизвестнойМаркируемойПродукцииБезЗапросаСтатусаМОТП(Штрихкоды, ПараметрыСканирования); // проверяем на то что это марк товар.

	Возврат Результат;
КонецФункции
